Web/The_Web_Developer_Bootcamp_2024/003.HTML_The_Essentials/003.000.Notes.org
#+title: Section 3: HTML - The Essentials
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%} .content ul:not(:first-child) {margin-top: 0.25em}}</style>

* Navigation
| Nav   | Title                                    | Links                                   |
|-------+------------------------------------------+-----------------------------------------|
| Index | Notes Home                               | \vert [[file:../../../index.html][html]] \vert [[file:../../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | The Web Developer Bootcamp 2024          | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/The_Web_Developer_Bootcamp_2024][github]] \vert |
| Prev  | Section 2: Course Orientation            | \vert [[file:../002.An_Introduction_to_Web_Development/002.000.Notes.html][html]] \vert [[file:../002.An_Introduction_to_Web_Development/002.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/The_Web_Developer_Bootcamp_2024/002.An_Introduction_to_Web_Development][github]] \vert |
| Next  | Section 4: HTML - Next Steps & Semantics | \vert [[file:../004.HTML_Next_Steps_and_Semantics/004.000.Notes.html][html]] \vert [[file:../004.HTML_Next_Steps_and_Semantics/004.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/The_Web_Developer_Bootcamp_2024/004.HTML_Next_Steps_and_Semantics][github]] \vert |

* Resources
[[file:./003.HTML_The_Essentials_Slides.pdf][Section 3: HTML - The Essentials Slides]]

* Notes

** Section 3.1: What Matters In This Section
   - Paragraph elements, HTML headings, HTML lists, HTML anchor tags, HTML images, and HTML boilerplate are crucial parts of this section
   - MDN is an important resource

** Section 3.2: Introduction to HTML
   - HTML is the what is on the page (buttons, lists, headers, etc.)
   - HTML is HyperText Markup Language, it is not a programming language (you can't implemenet logic with HTML)
   - All that HTML does is "markup" a document or annotate a document or add more information to the current document
   - The goal of HTML is to take text (a document) and markup and add some structure to the document
   - For example, if you have a sentence like "I like donuts!"; how do you bold it and italicize it? Some syntax can be used to describe that "markup"
   - So what is this syntax? The syntax is HTML and HTML has HTML elements
   - Each HTML elements have something caled tags and the content you want to "markup" is enclosed by these tags (e.g. ~<tag> content </tag>~ )
   - So now you have a way to markup text in a document to be bold or italicized (although note that are some self-closing tags but those typically do not markup text in a document)
   - For example, if we want "I like donuts!" to be in bold I can just do "<b>I like donuts!</b>", notice how we now have a syntax to markup text
   - In reality, HTML has various HTML elements that used in a HTML document with various elements being nested in each other
   - Now we can do a lot with HTML like bold, headers, paragraphs, links, display images, lists, etc
     
** Section 3.3: Our Very First HTML Page
   - Whenever you don't close a tag, the browser will implement the markup from the opening tag to the end of the document because it is trying to find the closing tag but there is none
   - [[file:./003.003.Our_Very_First_HTML_Page/index.html][Here is the finished web page]]
     
** Section 3.4: Mozilla Developer Network
   - [[https://developer.mozilla.org/en-US/][Mozilla Developer Resources (Home)]]
   - [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element][Mozilla Developer HTML Elements Reference]]
   - Think of Mozilla Developer resources as the Wikipedia of HTML, CSS, and JS

** Section 3.5: Paragraph Elements
   - [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p][Mozilla Paragraph Element]]
   - The ~<p>~ HTML element represents a paragraph (hence paragraph element)
   - The paragraph element doesn't necessarily mean a paragraph of text (although often the case), a paragraph can be any related content that you want to group together such as images or form fields
   - Paragraphs are block-level elements and will automatically close if another block-level element is parsed or encountered (nested) befroe the closing ~</p>~ tag

** Section 3.6: Heading Elements
   - [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/Heading_Elements][Mozilla Heading Elements]]
   - The heading element represent six level of section headings with ~<h1>~ being the highest section level and ~<h6>~ being the lowest
   - All heading elements create a block-level box in the layout (starting on a new line and taking up the full width available in their containing block)
   - Do not use the headings just because of the size or style (because that can be changed in CSS)
   - Only have one h1 in the page nd it should always be the top level main heading
   - Always have the heading sections in order and do not skip heading sections (do not go from h2 to h4; you are skipping h3; do not do that, go in order)

