The Web Developer Bootcamp 2024/003.HTML - The Essentials/003.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-11 Thu 18:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sec.3 HTML - The Essentials</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../scratch/bulma/css/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Sec.3 HTML - The Essentials</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org57d2f6c">Navigation</a></li>
<li><a href="#org55a6ea8">Resources</a></li>
<li><a href="#org6cf00cb">Notes</a>
<ul>
<li><a href="#orgcb74948">Section 3.1: What Matters In This Section</a></li>
<li><a href="#org13d96b9">Section 3.2: Introduction to HTML</a></li>
<li><a href="#orgbf48ebc">Section 3.3: Our Very First HTML Page</a></li>
<li><a href="#orgd9a5679">Section 3.4: Mozilla Developer Network</a></li>
<li><a href="#orgef47e82">Section 3.5: Paragraph Elements</a></li>
<li><a href="#org901ba22">Section 3.6: Heading Elements</a></li>
<li><a href="#org17f8d6d">Section 3.7: HTML Boilerplate</a></li>
<li><a href="#org891f7c7">Section 3.8: List Elements</a></li>
<li><a href="#orgf72c7d6">Section 3.9: Anchor Tags</a></li>
<li><a href="#org294fa8e">Section 3.10: Images</a></li>
<li><a href="#orgb97b5ac">Section 3.11: Comments</a></li>
</ul>
</li>
<li><a href="#org66d7d24">Keywords</a></li>
<li><a href="#orga5571bb">Questions</a></li>
<li><a href="#orgda5f47b">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org57d2f6c" class="outline-2">
<h2 id="org57d2f6c">Navigation</h2>
<div class="outline-text-2" id="text-org57d2f6c">
<p>
<b>Home</b> [<a href="../000.Home.html">html</a>] [<a href="../000.Home.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/The%20Web%20Developer%20Bootcamp%202024">github</a>]
</p>

<p>
<b>Prev</b>: Sec.2 An Introduction to Web Development [<a href="file:///Users/alfre/Documents/notes/The Web Developer Bootcamp 2024/002.An Introduction to Web Development/002.000.Notes.html">html</a>] [<a href="file:///Users/alfre/Documents/notes/The Web Developer Bootcamp 2024/002.An Introduction to Web Development/002.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/The%20Web%20Developer%20Bootcamp%202024/002.An%20Introduction%20to%20Web%20Development">github</a>]
</p>

<p>
<b>Next</b>: Sec.4 HTML - Next Steps &amp; Semantics [<a href="../004.HTML - Next Steps &amp; Semantics/004.000.Notes.html">html</a>] [<a href="../004.HTML - Next Steps &amp; Semantics/004.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/The%20Web%20Developer%20Bootcamp%202024/004.HTML%20-%20Next%20Steps%20%26%20Semantics">github</a>]
</p>
</div>
</div>

<div id="outline-container-org55a6ea8" class="outline-2">
<h2 id="org55a6ea8">Resources</h2>
<div class="outline-text-2" id="text-org55a6ea8">
<p>
<a href="003.HTML - The Essentials Slides.pdf">Section 3: HTML - The Essentials Slides</a>
</p>
</div>
</div>

<div id="outline-container-org6cf00cb" class="outline-2">
<h2 id="org6cf00cb">Notes</h2>
<div class="outline-text-2" id="text-org6cf00cb">
</div>
<div id="outline-container-orgcb74948" class="outline-3">
<h3 id="orgcb74948">Section 3.1: What Matters In This Section</h3>
<div class="outline-text-3" id="text-orgcb74948">
<ul class="org-ul">
<li>Paragraph elements, HTML headings, HTML lists, HTML anchor tags, HTML images, and HTML boilerplate are crucial parts of this section</li>
<li>MDN is an important resource</li>
</ul>
</div>
</div>

<div id="outline-container-org13d96b9" class="outline-3">
<h3 id="org13d96b9">Section 3.2: Introduction to HTML</h3>
<div class="outline-text-3" id="text-org13d96b9">
<ul class="org-ul">
<li>HTML is the what is on the page (buttons, lists, headers, etc.)</li>
<li>HTML is HyperText Markup Language, it is not a programming language (you can't implemenet logic with HTML)</li>
<li>All that HTML does is "markup" a document or annotate a document or add more information to the current document</li>
<li>The goal of HTML is to take text (a document) and markup and add some structure to the document</li>
<li>For example, if you have a sentence like "I like donuts!"; how do you bold it and italicize it? Some syntax can be used to describe that "markup"</li>
<li>So what is this syntax? The syntax is HTML and HTML has HTML elements</li>
<li>Each HTML elements have something caled tags and the content you want to "markup" is enclosed by these tags (e.g. <code>&lt;tag&gt; content &lt;/tag&gt;</code> )</li>
<li>So now you have a way to markup text in a document to be bold or italicized (although note that are some self-closing tags but those typically do not markup text in a document)</li>
<li>For example, if we want "I like donuts!" to be in bold I can just do "&lt;b&gt;I like donuts!&lt;/b&gt;", notice how we now have a syntax to markup text</li>
<li>In reality, HTML has various HTML elements that used in a HTML document with various elements being nested in each other</li>
<li>Now we can do a lot with HTML like bold, headers, paragraphs, links, display images, lists, etc</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf48ebc" class="outline-3">
<h3 id="orgbf48ebc">Section 3.3: Our Very First HTML Page</h3>
<div class="outline-text-3" id="text-orgbf48ebc">
<ul class="org-ul">
<li>Whenever you don't close a tag, the browser will implement the markup from the opening tag to the end of the document because it is trying to find the closing tag but there is none</li>
<li><a href="003.003.Our Very First HTML Page/index.html">Here is the finished web page</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd9a5679" class="outline-3">
<h3 id="orgd9a5679">Section 3.4: Mozilla Developer Network</h3>
<div class="outline-text-3" id="text-orgd9a5679">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/">Mozilla Developer Resources (Home)</a></li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element">Mozilla Developer HTML Elements Reference</a></li>
<li>Think of Mozilla Developer resources as the Wikipedia of HTML, CSS, and JS</li>
</ul>
</div>
</div>

<div id="outline-container-orgef47e82" class="outline-3">
<h3 id="orgef47e82">Section 3.5: Paragraph Elements</h3>
<div class="outline-text-3" id="text-orgef47e82">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/p">Mozilla Paragraph Element</a></li>
<li>The <code>&lt;p&gt;</code> HTML element represents a paragraph (hence paragraph element)</li>
<li>The paragraph element doesn't necessarily mean a paragraph of text (although often the case), a paragraph can be any related content that you want to group together such as images or form fields</li>
<li>Paragraphs are block-level elements and will automatically close if another block-level element is parsed or encountered (nested) befroe the closing <code>&lt;/p&gt;</code> tag</li>
</ul>
</div>
</div>

<div id="outline-container-org901ba22" class="outline-3">
<h3 id="org901ba22">Section 3.6: Heading Elements</h3>
<div class="outline-text-3" id="text-org901ba22">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/Heading_Elements">Mozilla Heading Elements</a></li>
<li>The heading element represent six level of section headings with <code>&lt;h1&gt;</code> being the highest section level and <code>&lt;h6&gt;</code> being the lowest</li>
<li>All heading elements create a block-level box in the layout (starting on a new line and taking up the full width available in their containing block)</li>
<li>Do not use the headings just because of the size or style (because that can be changed in CSS)</li>
<li>Only have one h1 in the page nd it should always be the top level main heading</li>
<li>Always have the heading sections in order and do not skip heading sections (do not go from h2 to h4; you are skipping h3; do not do that, go in order)</li>
</ul>
</div>
</div>
