Web/The_Web_Developer_Bootcamp_2024/003.HTML_The_Essentials/003.000.Notes.org
** Section 3.7: HTML Boilerplate
   - Every HTML document needs structure needs the HTML boilerplate or "skeleton"

   #+BEGIN_SRC html
     <!DOCTYPE html>
     <html>
       <head>
	 <title></title>
       </head>

       <body>
       </body>
     </html>
   #+END_SRC

   - The ~DOCTYPE~ tells the browser we want or are using the latest version of HTML (HTML5)
   - ~<html>~ is the root element ([[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/html][Mozilla HTML Element]]) and represetns the top-level (root) of an HTML document; all other elements must be descendants (nested) of this element
   - The html element can only have one ~<head>~ followed by one ~<body>~ element
   - The head element or Document Metadata element ([[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/head][Mozilla Header Element]]) is all metadata or information about the page; this will not be displayed in the browser
   - The title element ([[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/title][Mozilla Title Element]]) defines the document's title and it will be shown in the browser's title bar or page's tab
   - The body element ([[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body][Mozilla Body Element]]) represents all of the content of the document; there can only be one body in the document and everything that will be displayed in the browser will be in the body
   - This would be the skeleton of every HTML document we create from now on     

** Section 3.8: List Elements
   - There are two types of lists: unordered lists and ordered lists
   - ~<ol>~ is for ordered lists and ~<ul>~ is for unordered lists
   - Each list as a nested element called an list item
   - [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ol][Mozilla Ordered List]], [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ul][Mozilla Unordered List]], [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/li][Mozilla List Item]]
   - Inside list items, we can have more nested lists (ordered or unordered)
   - List items can have more nested elements unlike ~<ol>~ or ~<ul>~ which can only have ~<li>~ (and ~<script>~ and ~<template>~)

** Section 3.9: Anchor Tags
   - Anchor tags ([[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/a][Mozilla Anchor Element]]) are used to create links to other web pages, files, email addresses, or just a location in the same page
   - The most common is creating hyperlinks to different web pages
   - The way it is used is by inserting the ~<a>~ and ~</a>~ tags placing the text that is going to be the link inside the tags
   - However by itself the anchor tags will not create the link
   - In addition to the anchor tags you will need to use the ~href~ attribute
   - ~href~ attribute will be the URL to the location of the file, section, email address, web page, etc
   - Anchor elements can use the links to point to other HTML files in the current working directory or in the same computer (if permissions allow)

** Section 3.10: Images
   - The image element ([[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/img][Mozilla Image Element]]) allows for the browser to render an image into the document
   - To provide the location of the image we use an attribute called ~src~; this attribute is required and contains the path to the image you want to embed into the document
   - The image element is self-closing and does not need a closing tag
   - The src can be a local file or an image on the internet; the src attribute will embed the image into the HTML document
   - The alt attribute is definitely recommended to have for accessbility purposes or if the images does not load but the alt attribute is a text description of the image

** Section 3.11: Comments
   - Comments in a HTML file is not an element; it is just a way to add notes, feedback, reminders, etc
   - Comments are ignored by the browser; it is just for the developer to see the comments as reminders or explanations of the code written
   - The syntax for a comment is the following:

     #+BEGIN_SRC html
       <!-- Comment -->
     #+END_SRC

    - Notice the ~<!--~ in the beginning and then the end is ~-->~ and everything in between is considered a comment
     
* Keywords
| Term                  | Definition                                                                                                                                                                                                                |
|-----------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| *HTML*                | HyperText Markup Language; it is not a programming language instead it is a markup language which means it has syntax to "markup" text (e.g. how to make it bold, how to make it italicized, how to make a heading, etc.) |
| *Paragraph Element*   | Represents a paragraph; doesn't necessarily mean a paragraph of text but it can also be content that you want to group together such as images or form elements                                                           |
| *Heading Element*     | Heading element represetns six level of section headings                                                                                                                                                                  |
| *HTML Boilerplate*    | Every HTML document needs structure and this structure is the skeleton of the document and it is the same across every HTML document                                                                                      |
| *HTML Root Element*   | The root element is the outer most HTML element and can only have two children: one for head and one for body                                                                                                             |
| *HTML Head Element*   | The metadata element (header) contains all the metadata of the webpage; none of the content gets displayed is just metadata for the browser                                                                               |
| *HTML Body Element*   | The body element contains all the content that will be displayed and rendered by the browser                                                                                                                              |
| *HTML List Element*   | The list element creates a list in HTML; it can be ordered (~<ol>~) or unordered (~<ul>~)                                                                                                                                 |
| *HTML Anchor Element* | Anchor element is used to create hyperlinks to files, other web pages, email addresses, etc                                                                                                                               |
| *HTML Image Element*  | Image element is self closing and is used to embed an image (from a local file or from a server) into the document                                                                                                        |
| *Comments*            | Comments are ignored by the browser and are only for the developer to see as notes, reminders, TODO list, explanations, etc                                                                                               |

