The Web Developer Bootcamp 2024/003.HTML - The Essentials/003.000.Notes.html

<div id="outline-container-org17f8d6d" class="outline-3">
<h3 id="org17f8d6d">Section 3.7: HTML Boilerplate</h3>
<div class="outline-text-3" id="text-org17f8d6d">
<ul class="org-ul">
<li>Every HTML document needs structure needs the HTML boilerplate or "skeleton"</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;&lt;/title&gt;
  &lt;/head&gt;

  &lt;body&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>
</div>

<ul class="org-ul">
<li>The <code>DOCTYPE</code> tells the browser we want or are using the latest version of HTML (HTML5)</li>
<li><code>&lt;html&gt;</code> is the root element (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/html">Mozilla HTML Element</a>) and represetns the top-level (root) of an HTML document; all other elements must be descendants (nested) of this element</li>
<li>The html element can only have one <code>&lt;head&gt;</code> followed by one <code>&lt;body&gt;</code> element</li>
<li>The head element or Document Metadata element (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/head">Mozilla Header Element</a>) is all metadata or information about the page; this will not be displayed in the browser</li>
<li>The title element (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/title">Mozilla Title Element</a>) defines the document's title and it will be shown in the browser's title bar or page's tab</li>
<li>The body element (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/body">Mozilla Body Element</a>) represents all of the content of the document; there can only be one body in the document and everything that will be displayed in the browser will be in the body</li>
<li>This would be the skeleton of every HTML document we create from now on</li>
</ul>
</div>
</div>

<div id="outline-container-org891f7c7" class="outline-3">
<h3 id="org891f7c7">Section 3.8: List Elements</h3>
<div class="outline-text-3" id="text-org891f7c7">
<ul class="org-ul">
<li>There are two types of lists: unordered lists and ordered lists</li>
<li><code>&lt;ol&gt;</code> is for ordered lists and <code>&lt;ul&gt;</code> is for unordered lists</li>
<li>Each list as a nested element called an list item</li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ol">Mozilla Ordered List</a>, <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ul">Mozilla Unordered List</a>, <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/li">Mozilla List Item</a></li>
<li>Inside list items, we can have more nested lists (ordered or unordered)</li>
<li>List items can have more nested elements unlike <code>&lt;ol&gt;</code> or <code>&lt;ul&gt;</code> which can only have <code>&lt;li&gt;</code> (and <code>&lt;script&gt;</code> and <code>&lt;template&gt;</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf72c7d6" class="outline-3">
<h3 id="orgf72c7d6">Section 3.9: Anchor Tags</h3>
<div class="outline-text-3" id="text-orgf72c7d6">
<ul class="org-ul">
<li>Anchor tags (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/a">Mozilla Anchor Element</a>) are used to create links to other web pages, files, email addresses, or just a location in the same page</li>
<li>The most common is creating hyperlinks to different web pages</li>
<li>The way it is used is by inserting the <code>&lt;a&gt;</code> and <code>&lt;/a&gt;</code> tags placing the text that is going to be the link inside the tags</li>
<li>However by itself the anchor tags will not create the link</li>
<li>In addition to the anchor tags you will need to use the <code>href</code> attribute</li>
<li><code>href</code> attribute will be the URL to the location of the file, section, email address, web page, etc</li>
<li>Anchor elements can use the links to point to other HTML files in the current working directory or in the same computer (if permissions allow)</li>
</ul>
</div>
</div>

<div id="outline-container-org294fa8e" class="outline-3">
<h3 id="org294fa8e">Section 3.10: Images</h3>
<div class="outline-text-3" id="text-org294fa8e">
<ul class="org-ul">
<li>The image element (<a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/img">Mozilla Image Element</a>) allows for the browser to render an image into the document</li>
<li>To provide the location of the image we use an attribute called <code>src</code>; this attribute is required and contains the path to the image you want to embed into the document</li>
<li>The image element is self-closing and does not need a closing tag</li>
<li>The src can be a local file or an image on the internet; the src attribute will embed the image into the HTML document</li>
<li>The alt attribute is definitely recommended to have for accessbility purposes or if the images does not load but the alt attribute is a text description of the image</li>
</ul>
</div>
</div>

<div id="outline-container-orgb97b5ac" class="outline-3">
<h3 id="orgb97b5ac">Section 3.11: Comments</h3>
<div class="outline-text-3" id="text-orgb97b5ac">
<ul class="org-ul">
<li>Comments in a HTML file is not an element; it is just a way to add notes, feedback, reminders, etc</li>
<li>Comments are ignored by the browser; it is just for the developer to see the comments as reminders or explanations of the code written</li>
<li><p>
The syntax for a comment is the following:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;!-- Comment --&gt;
</pre>
</div>

<ul class="org-ul">
<li>Notice the <code>&lt;!--</code> in the beginning and then the end is <code>--&gt;</code> and everything in between is considered a comment</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org66d7d24" class="outline-2">
<h2 id="org66d7d24">Keywords</h2>
<div class="outline-text-2" id="text-org66d7d24">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>HTML</b></td>
<td class="org-left">HyperText Markup Language; it is not a programming language instead it is a markup language which means it has syntax to "markup" text (e.g. how to make it bold, how to make it italicized, how to make a heading, etc.)</td>
</tr>

<tr>
<td class="org-left"><b>Paragraph Element</b></td>
<td class="org-left">Represents a paragraph; doesn't necessarily mean a paragraph of text but it can also be content that you want to group together such as images or form elements</td>
</tr>

<tr>
<td class="org-left"><b>Heading Element</b></td>
<td class="org-left">Heading element represetns six level of section headings</td>
</tr>

<tr>
<td class="org-left"><b>HTML Boilerplate</b></td>
<td class="org-left">Every HTML document needs structure and this structure is the skeleton of the document and it is the same across every HTML document</td>
</tr>

<tr>
<td class="org-left"><b>HTML Root Element</b></td>
<td class="org-left">The root element is the outer most HTML element and can only have two children: one for head and one for body</td>
</tr>

<tr>
<td class="org-left"><b>HTML Head Element</b></td>
<td class="org-left">The metadata element (header) contains all the metadata of the webpage; none of the content gets displayed is just metadata for the browser</td>
</tr>

<tr>
<td class="org-left"><b>HTML Body Element</b></td>
<td class="org-left">The body element contains all the content that will be displayed and rendered by the browser</td>
</tr>

<tr>
<td class="org-left"><b>HTML List Element</b></td>
<td class="org-left">The list element creates a list in HTML; it can be ordered (<code>&lt;ol&gt;</code>) or unordered (<code>&lt;ul&gt;</code>)</td>
</tr>

<tr>
<td class="org-left"><b>HTML Anchor Element</b></td>
<td class="org-left">Anchor element is used to create hyperlinks to files, other web pages, email addresses, etc</td>
</tr>

<tr>
<td class="org-left"><b>HTML Image Element</b></td>
<td class="org-left">Image element is self closing and is used to embed an image (from a local file or from a server) into the document</td>
</tr>

<tr>
<td class="org-left"><b>Comments</b></td>
<td class="org-left">Comments are ignored by the browser and are only for the developer to see as notes, reminders, TODO list, explanations, etc</td>
</tr>
</tbody>
</table>
</div>
</div>
