Web/The_Web_Developer_Bootcamp_2024/003.HTML_The_Essentials/003.000.Notes.org
* Questions
  - *Q*: What can go inside the header element?
         - It can contain one or more elements of metadata content and exactly one ~<title>~ element
	   
  - *Q*: What are metadata elements?
         - [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/meta][Mozilla Metadata Element]] - According to the docs, the metadata element represents metadata that cannot be represented by other HTML meta-related elements
         - There are various metadata that can be represented by the meta element
         - It can define keywords for search engines, description, author, refresh document every X seconds, set the viewport, and many more
         - The way it works is that there are four attributes mainly used meta: name, http-equiv, charset, and itemprop
         - Let's first look at name; name is used along with the attribute called content these two attributes work together to specify some metadata
	   - According to mozilla docs: the name and content attributes can be used together to provide document metadata in terms of name-value pairs, with the name attribute giving the metadata name, and the content attribute giving the value
	   - [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/meta/name][Mozilla Standard Metadata Names]]
	   - So basically to provide some metadata we use the attribute ~name~ and give it the value author, description, keywords, etc. whatever we want to provide info about and then the attribute content would be the value of that metadata
         - The next attribute that the meta element can use is the ~http-equiv~; according to the docs if this attribute is set the element would be a pragma directive providing info equivalent to what can be given by a similarly-named HTTP header
	   - So basically instead of modifying or adding some specification to the HTTP header request, we do so in the meta element
	   - [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/meta#http-equiv][Mozilla http-equiv Docs]]
	   - This includes values like ~content-security-policy~, ~content-type~, ~refresh~, ~default-style~, and ~x-ua-compatible~
	   - The content attribute needs to be used too to provide a value to the attribute ~http-equiv~ (whichever one specificed)
         - Other attributes are ~charset~ which sets the charset declaration and ~itemprop~ which can add properties to a HTML element

* Summary
  - HTML is HyperText Markup Language, it is a language that has syntax to markup text, thus it can specify which text is bold, which text is a header, etc
  - HTML consists of various elements including: paragraph element, heading element, head element, root element, body element, meta element, list element, anchor element, image element, and more
  - Each HTML element has a boilerplate or a skeleton that every HTML document should have; the version of html is declared using ~DOCTYPE~
  - Then the root element is the first HTML element; the root element can only have one head and one body
  - The head element is an element that is used for metadata and information inside the head element will not be rendered by the browser
  - Metadata information can be provided by the meta element which has various attribute pair values to specify info about the web page
  - The title element specifies the title of the web page
  - The body element is what the browser renders so everything that will be displayed in the browser will be in the body element
  - This includes the heading which has six levels of heading sections; the rules (suggestions) are there should only be one h1 in the webpage and do not skip headings
  - The paragraph element can also be used inside the body and it is used to group content such as text, images, or form elements
  - Inisde the body there can also be ordered or unordered lists and nested lists as well
  - Anchor element is used to create hyperlinks and the image element is used to embed an image in the webpage
  - Finally, you can create comments in the HTML document which is ignored by the browser and is only used for the developer's case
