The Web Developer Bootcamp 2024/003.HTML - The Essentials/003.000.Notes.html

<div id="outline-container-orga5571bb" class="outline-2">
<h2 id="orga5571bb">Questions</h2>
<div class="outline-text-2" id="text-orga5571bb">
<ul class="org-ul">
<li><b>Q</b>: What can go inside the header element?
<ul class="org-ul">
<li>It can contain one or more elements of metadata content and exactly one <code>&lt;title&gt;</code> element</li>
</ul></li>

<li><b>Q</b>: What are metadata elements?
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/meta">Mozilla Metadata Element</a> - According to the docs, the metadata element represents metadata that cannot be represented by other HTML meta-related elements</li>
<li>There are various metadata that can be represented by the meta element</li>
<li>It can define keywords for search engines, description, author, refresh document every X seconds, set the viewport, and many more</li>
<li>The way it works is that there are four attributes mainly used meta: name, http-equiv, charset, and itemprop</li>
<li>Let's first look at name; name is used along with the attribute called content these two attributes work together to specify some metadata
<ul class="org-ul">
<li>According to mozilla docs: the name and content attributes can be used together to provide document metadata in terms of name-value pairs, with the name attribute giving the metadata name, and the content attribute giving the value</li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/meta/name">Mozilla Standard Metadata Names</a></li>
<li>So basically to provide some metadata we use the attribute <code>name</code> and give it the value author, description, keywords, etc. whatever we want to provide info about and then the attribute content would be the value of that metadata</li>
</ul></li>
<li>The next attribute that the meta element can use is the <code>http-equiv</code>; according to the docs if this attribute is set the element would be a pragma directive providing info equivalent to what can be given by a similarly-named HTTP header
<ul class="org-ul">
<li>So basically instead of modifying or adding some specification to the HTTP header request, we do so in the meta element</li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/meta#http-equiv">Mozilla http-equiv Docs</a></li>
<li>This includes values like <code>content-security-policy</code>, <code>content-type</code>, <code>refresh</code>, <code>default-style</code>, and <code>x-ua-compatible</code></li>
<li>The content attribute needs to be used too to provide a value to the attribute <code>http-equiv</code> (whichever one specificed)</li>
</ul></li>
<li>Other attributes are <code>charset</code> which sets the charset declaration and <code>itemprop</code> which can add properties to a HTML element</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgda5f47b" class="outline-2">
<h2 id="orgda5f47b">Summary</h2>
<div class="outline-text-2" id="text-orgda5f47b">
<ul class="org-ul">
<li>HTML is HyperText Markup Language, it is a language that has syntax to markup text, thus it can specify which text is bold, which text is a header, etc</li>
<li>HTML consists of various elements including: paragraph element, heading element, head element, root element, body element, meta element, list element, anchor element, image element, and more</li>
<li>Each HTML element has a boilerplate or a skeleton that every HTML document should have; the version of html is declared using <code>DOCTYPE</code></li>
<li>Then the root element is the first HTML element; the root element can only have one head and one body</li>
<li>The head element is an element that is used for metadata and information inside the head element will not be rendered by the browser</li>
<li>Metadata information can be provided by the meta element which has various attribute pair values to specify info about the web page</li>
<li>The title element specifies the title of the web page</li>
<li>The body element is what the browser renders so everything that will be displayed in the browser will be in the body element</li>
<li>This includes the heading which has six levels of heading sections; the rules (suggestions) are there should only be one h1 in the webpage and do not skip headings</li>
<li>The paragraph element can also be used inside the body and it is used to group content such as text, images, or form elements</li>
<li>Inisde the body there can also be ordered or unordered lists and nested lists as well</li>
<li>Anchor element is used to create hyperlinks and the image element is used to embed an image in the webpage</li>
<li>Finally, you can create comments in the HTML document which is ignored by the browser and is only used for the developer's case</li>
</ul>
</div>
</div>
</div>
</body>
</html>
